<?php
namespace App\dependencyInjection;


//No Depedency on Course to change anytime now.

class Course
{
    public $cid;
    function __construct($cid)
    {
        $this->cid = $cid;
    }
}


/*


$course = new Course(1);
$lesson = new Lesson(100,$course);

//Dependency Injection
$quiz = new Quiz(1, $lesson, $course);

echo "Course ID: " . $quiz->cid . PHP_EOL;
echo "Lesson ID: " . $quiz->lid . PHP_EOL;
echo "Quiz ID: " . $quiz->qid . PHP_EOL;


*/ 

/*

প্যারেন্ট ক্লাস যদি চাইল্ড ক্লাস সম্পর্কে কিছুই না জানে, তবে সেটা হচ্ছে লুজলি কাপল্‌ড রিলেশনশীপ।
উদাহরন হিসেবে, আমরা একটা সিনারিও নিয়ে আসতে পারি। যেমন আমরা একটি কোর্স ডিজাইন করব। সেই কোর্সে কিছু লেসন থাকবে, কিছু কুইজ থাকবে। তাহলে এখানে আমার অবজেক্ট হচ্ছে ৩টি।
প্রথমে আমরা কোর্স অবজেক্টের একটি নকশা বা ক্লাস ডিজাইন করব। সেই নকশা ডিজাইন করতে গিয়ে আমরা, কি কি লেসন থাকবে বা কি কি কুইজ থাকবে সেটা আমরা আমাদের নকশাতে আনবনা। এখানে খাকবে কোর্স সংক্রান্ত তথ্য যেমন - কোর্স আইডি, কোর্স টাইটেল, কোর্স ডেসক্রিপশন ইত্যাদি।
এখন আসি যখন আমরা লেসন অবজেক্টের নকশা ডিজাইন করব, তখন আমরা এই লেসনটি কোন কোর্সের অন্তর্ভুক্ত সেটা বুঝানোর জন্য একটি নির্দিষ্ট কোর্স অবজেক্টের সাথে তার রিলেশনশীপ তৈরী করব। অর্থাৎ এখানে রিলেশনশীপ নিয়ে চিন্তা করছে চাইল্ড ক্লাস। অর্থাৎ একটা লেসন তৈরী করার সময় লেসন সংক্রান্ত তথ্য উল্লেখ করার সাথে সাথে একটি নির্দিষ্ট কোর্সের অবজেক্টের তথ্য যোগ করে দেব।
এই কোর্সে যদি কুইজ অন্তর্ভুক্ত হয় সে সম্পর্কে কোর্স এবং লেসনের কোন চিন্তা করার দরকার নাই।
যখন আমরা কুইজ অবজেক্টের নকশা অর্থাৎ ক্লাস ডিজাইন করব , তখন আমরা চিন্তা করব এটা কোন লেসনের অন্তর্ভুক্ত হবে। অর্থাৎ চাইল্ড অবজেক্ট (কুইজ অবজেক্ট) চিন্তা করছে সে কোন লেসনের অন্তর্ভুক্ত হবে।
এভাবে আমরা লুজলি কাপলড ডিজাইন করতে পারি।
আপনাদের ফিডব্যাক জানাবেন।


*/ 